---
kind: other
id: Properties.T:Autodesk.Revit.DB.SolidCurveIntersection
source: html/c491a73d-4eaa-2ae0-57f6-d2a5fec2f746.htm
---
# SolidCurveIntersection Properties

Specifies whether the .NET object represents a valid Revit entity.